lexis_nexis_1

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:lnrisk:ws:wsinsmultiproduct:wsinsmultiproduct" xmlns:urn1="urn:lnrisk:ws:wsinsurancerules:ruleplan@ver=1">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:handleRequest>
        <Request xmlns="urn:lnrisk:ws:wsinsurancerules:ruleplan@ver=1">
    <RequesterInformation>
        <Name>VINReq</Name>
        <AccountNumber>587578TST</AccountNumber>
    </RequesterInformation>
    <TransactionDetails>
        <RuleplanId>5200</RuleplanId>
        <SidexInfo>
            <SourceNode>IP0313800</SourceNode>
        </SidexInfo>
        <QuoteBacks>
            <QuoteBack>
                <Name>LNRiskXML</Name>
                <Value>VIN</Value>
            </QuoteBack>
        </QuoteBacks>
    </TransactionDetails>
    <SearchBy>
        <Vehicles>
            <InquiryVehicle vehicleId="VEH1">
            	 <PlateNumber>AZ01DOD435</PlateNumber>
                <PlateState>AZ</PlateState>
            </InquiryVehicle>
        </Vehicles>
    </SearchBy>
    <Products>
        <VehicleIdentification>
            <InquiryVehicleIdentification>
                <SearchBy>
                    <Vehicles>
                        <Vehicle ref="VEH1">VEH1</Vehicle>
                    </Vehicles>
                    <Type>VIN Plate Only Services Type</Type>
                </SearchBy>
            </InquiryVehicleIdentification>
        </VehicleIdentification>
    </Products>
</Request>
      </urn:handleRequest>
   </soapenv:Body>
</soapenv:Envelope>
